src/Enums/СтатусыКвестов/СтатусыКвестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКвестов</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Провален</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыСобытий/СтатусыСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСобытий</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ИнструментыАссистентаСервер/Module.bsl
// Серверный слой read-only инструментов AI-ассистента.
//
// Назначение:
//   - предоставить единый внутренний boundary для AI-инструментов;
//   - описать реестр доступных инструментов для последующей JSON-сериализации;
//   - выполнить валидацию входных аргументов;
//   - выполнить диспетчеризацию вызовов по белому списку имен;
//   - преобразовать прикладные данные в компактный AI-facing DTO.
//
// Слой не реализует:
//   - HTTP-сервисы;
//   - работу с LLM (Ollama, OpenAI и т. п.);
//   - tool-call loop / orchestrator;
//   - историю сообщений;
//   - write-инструменты;
//   - изменение прикладных данных.
//
// Источник истины по предметным данным:
//   - активная кампания   - УправлениеКампаниями.ПолучитьАктивнуюКампанию();
//   - снимок контекста     - КонтекстАссистента.ПолучитьКонтекст();
//   - имя элемента         - ОбщегоНазначения.ЗначенияРеквизитовОбъекта();
//   - игровая дата         - ИгровойКалендарь.ПредставлениеДаты();
//   - предметный поиск     - ПоискСущностей.
//
// Прямых обращений к регистрам и справочникам модуль не выполняет.
// Привилегированный режим не используется.

#Область ПрограммныйИнтерфейс

// Возвращает реестр доступных AI-инструментов в виде, пригодном
// для последующей JSON-сериализации. Описание не хранится в БД -
// формируется функционально при каждом вызове.
//
// Возвращаемое значение:
//   Массив Из Структура - каждый элемент описывает один инструмент
//     и содержит поля:
//       * name         - Строка - техническое имя инструмента;
//       * description  - Строка - краткое описание для LLM (на русском);
//       * read_only    - Булево - всегда Истина для текущего этапа;
//       * input_schema - Структура - эквивалент JSON Schema,
//       описывающий допустимые аргументы.
//
Функция ПолучитьОписанияИнструментов() Экспорт

	Реестр = Новый Массив;
	Реестр.Добавить(ОписаниеИнструмента_GetCurrentContext());
	Реестр.Добавить(ОписаниеИнструмента_SearchEntities());
	Реестр.Добавить(ОписаниеИнструмента_GetEntity());

	Возврат Реестр;

КонецФункции

// Выполняет AI-инструмент по имени и возвращает унифицированный
// результат. Имя инструмента должно присутствовать в белом списке,
// аргументы - соответствовать input_schema соответствующего инструмента.
//
// Параметры:
//   ИмяИнструмента - Строка - техническое имя инструмента
//                  (см. ПолучитьОписанияИнструментов).
//   Аргументы      - Структура, Неопределено - аргументы вызова.
//                  Если для инструмента аргументы не требуются,
//                  допускается Неопределено или пустая Структура.
//
// Возвращаемое значение:
//   Структура - унифицированный результат:
//     * success  - Булево - признак успеха;
//     * data     - Структура, Неопределено - DTO результата при успехе;
//     * error    - Структура, Неопределено - описание ошибки при неуспехе:
//                   * code    - Строка - машинный код ошибки;
//                   * message - Строка - текст для пользователя/AI.
//
Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы = Неопределено) Экспорт

	Если НЕ ЭтоДопустимоеИмяИнструмента(ИмяИнструмента) Тогда
		Возврат РезультатОшибка("unknown_tool",	НСтр("ru = 'Неизвестное имя инструмента.'"));
	КонецЕсли;

	Попытка
		РезультатВызова = ВыполнитьИнструментВнутренний(ИмяИнструмента, Аргументы);
	Исключение
		ЗаписатьОшибкуВЖурнал(
			НСтр("ru = 'AI.Инструменты'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ИмяИнструмента,
			ИнформацияОбОшибке());
		Возврат РезультатОшибка("internal_error",
			НСтр("ru = 'Внутренняя ошибка выполнения инструмента.'"));
	КонецПопытки;

	Возврат РезультатВызова;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Делегирует вызов конкретной реализации по имени инструмента.
// Диспетчеризация выполняется явно, без Выполнить() по строковому имени,
// чтобы произвольная строка от AI не превращалась в вызов метода 1С.
//
// Параметры:
//   ИмяИнструмента - Строка - валидное имя инструмента;
//   Аргументы      - Структура, Неопределено - аргументы вызова.
//
// Возвращаемое значение:
//   Структура - унифицированный результат (см. ВыполнитьИнструмент).
//
Функция ВыполнитьИнструментВнутренний(ИмяИнструмента, Аргументы)

	Если ИмяИнструмента = "get_current_context" Тогда
		Возврат Выполнить_GetCurrentContext(Аргументы);
	ИначеЕсли ИмяИнструмента = "search_entities" Тогда
		Возврат Выполнить_SearchEntities(Аргументы);
	ИначеЕсли ИмяИнструмента = "get_entity" Тогда
		Возврат Выполнить_GetEntity(Аргументы);
	Иначе
		// Сюда управление не попадает: имя проверено выше через
		// ЭтоДопустимоеИмяИнструмента. На последующих этапах
		// (get_relations, get_calendar_agenda) добавляются
		// соответствующие ветви ИначеЕсли без изменения
		// внешнего контракта диспетчера.
		Возврат РезультатОшибка("unknown_tool",
			НСтр("ru = 'Неизвестное имя инструмента.'"));
	КонецЕсли;

КонецФункции

// Проверяет, что имя инструмента присутствует в белом списке.
//
// Параметры:
//   ИмяИнструмента - Строка.
//
// Возвращаемое значение:
//   Булево - Истина, если имя известно модулю.
//
Функция ЭтоДопустимоеИмяИнструмента(ИмяИнструмента)

	Если ТипЗнч(ИмяИнструмента) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ИмяИнструмента = "get_current_context"
		ИЛИ ИмяИнструмента = "search_entities"
		ИЛИ ИмяИнструмента = "get_entity";

КонецФункции

// Формирует описание инструмента get_current_context для реестра.
//
// Возвращаемое значение:
//   Структура - описание инструмента.
//
Функция ОписаниеИнструмента_GetCurrentContext()

	ЧастьОписания1 = НСтр("ru = 'Возвращает компактный контекст активной кампании:'");
	ЧастьОписания2 = НСтр("ru = 'кампанию, активного персонажа, текущую локацию, игровое время и кошелек.'");
	ЧастьОписания3 = НСтр("ru = 'Используется, когда дальнейший запрос зависит от текущего состояния кампании.'");
	ЧастьОписания4 = НСтр("ru = 'Аргументов не принимает.'");

	ОписаниеНазначения = ЧастьОписания1 + " " + ЧастьОписания2;
	ОписаниеПрименения = ЧастьОписания3 + " " + ЧастьОписания4;

	Описание = Новый Структура;
	Описание.Вставить("name", "get_current_context");
	Описание.Вставить("description", ОписаниеНазначения + " " + ОписаниеПрименения);
	Описание.Вставить("read_only", Истина);
	Описание.Вставить("input_schema", ПустаяСхемаОбъекта());

	Возврат Описание;

КонецФункции

// Формирует описание инструмента search_entities для реестра.
//
// Возвращаемое значение:
//   Структура - описание инструмента.
//
Функция ОписаниеИнструмента_SearchEntities()

	ЧастьОписания1 = НСтр("ru = 'Ищет сущности в активной кампании по имени или псевдониму.'");
	ЧастьОписания2 = НСтр("ru = 'Возвращает список кандидатов и не разрешает неоднозначность самостоятельно.'");
	ЧастьОписания3 = НСтр("ru = 'Используй types для ограничения поиска известными типами сущностей.'");

	Описание = Новый Структура;
	Описание.Вставить("name", "search_entities");
	Описание.Вставить("description", ЧастьОписания1 + " " + ЧастьОписания2 + " " + ЧастьОписания3);
	Описание.Вставить("read_only", Истина);
	Описание.Вставить("input_schema", СхемаАргументов_SearchEntities());

	Возврат Описание;

КонецФункции

// Возвращает JSON Schema аргументов инструмента search_entities.
// Описание собирается из единого источника поддерживаемых типов
// ПоискСущностей.ПоддерживаемыеТипы().
//
// Возвращаемое значение:
//   Структура - эквивалент JSON Schema.
//
Функция СхемаАргументов_SearchEntities()

	Enum = Новый Массив;
	Для Каждого ОписаниеТипа Из ПоискСущностей.ПоддерживаемыеТипы() Цикл
		Enum.Добавить(ОписаниеТипа.StableCode);
	КонецЦикла;

	Items = Новый Структура;
	Items.Вставить("type", "string");
	Items.Вставить("enum", Enum);

	Types = Новый Структура;
	Types.Вставить("type", "array");
	Types.Вставить("items", Items);
	Types.Вставить("minItems", 1);
	Types.Вставить("uniqueItems", Истина);

	Query = Новый Структура;
	Query.Вставить("type", "string");
	Query.Вставить("minLength", 1);
	Query.Вставить("maxLength", 150);

	Limit = Новый Структура;
	Limit.Вставить("type", "integer");
	Limit.Вставить("minimum", 1);
	Limit.Вставить("maximum", 20);
	Limit.Вставить("default", 10);

	Properties = Новый Структура;
	Properties.Вставить("query", Query);
	Properties.Вставить("types", Types);
	Properties.Вставить("limit", Limit);

	Required = Новый Массив;
	Required.Добавить("query");

	Схема = Новый Структура;
	Схема.Вставить("type", "object");
	Схема.Вставить("properties", Properties);
	Схема.Вставить("required", Required);
	Схема.Вставить("additionalProperties", Ложь);

	Возврат Схема;

КонецФункции

// Возвращает Структуру, эквивалентную JSON Schema:
//   { "type": "object", "properties": {}, "additionalProperties": false }.
//
// Используется как схема для инструментов, не принимающих аргументов.
//
// Возвращаемое значение:
//   Структура - пустая объектная схема.
//
Функция ПустаяСхемаОбъекта()

	Свойства = Новый Структура;

	Схема = Новый Структура;
	Схема.Вставить("type", "object");
	Схема.Вставить("properties", Свойства);
	Схема.Вставить("additionalProperties", Ложь);

	Возврат Схема;

КонецФункции

// Формирует описание инструмента get_entity для реестра.
//
// Возвращаемое значение:
//   Структура - описание инструмента.
//
Функция ОписаниеИнструмента_GetEntity()

	ЧастьОписания1 = НСтр("ru = 'Возвращает подробности конкретной сущности активной кампании'");
	ЧастьОписания2 = НСтр("ru = 'по идентификатору и типу.'");
	ЧастьОписания3 = НСтр("ru = 'Используй id и type из результата search_entities.'");
	ЧастьОписания4 = НСтр("ru = 'Не выполняет поиск по имени и не возвращает связи.'");

	Описание = Новый Структура;
	Описание.Вставить("name", "get_entity");
	Описание.Вставить("description", ЧастьОписания1 + " " + ЧастьОписания2
		+ " " + ЧастьОписания3 + " " + ЧастьОписания4);
	Описание.Вставить("read_only", Истина);
	Описание.Вставить("input_schema", СхемаАргументов_GetEntity());

	Возврат Описание;

КонецФункции

// Возвращает JSON Schema аргументов инструмента get_entity.
// Список допустимых значений type формируется функционально -
// из единого источника ПоискСущностей.ПоддерживаемыеТипы().
//
// Возвращаемое значение:
//   Структура - эквивалент JSON Schema.
//
Функция СхемаАргументов_GetEntity()

	Enum = Новый Массив;
	Для Каждого ОписаниеТипа Из ПоискСущностей.ПоддерживаемыеТипы() Цикл
		Enum.Добавить(ОписаниеТипа.StableCode);
	КонецЦикла;

	Id = Новый Структура;
	Id.Вставить("type", "string");
	Id.Вставить("minLength", 1);
	Id.Вставить("maxLength", 40);

	TypeItems = Новый Структура;
	TypeItems.Вставить("type", "string");
	TypeItems.Вставить("enum", Enum);

	Properties = Новый Структура;
	Properties.Вставить("id", Id);
	Properties.Вставить("type", TypeItems);

	Required = Новый Массив;
	Required.Добавить("id");
	Required.Добавить("type");

	Схема = Новый Структура;
	Схема.Вставить("type", "object");
	Схема.Вставить("properties", Properties);
	Схема.Вставить("required", Required);
	Схема.Вставить("additionalProperties", Ложь);

	Возврат Схема;

КонецФункции

// Реализация инструмента get_current_context:
//  1) проверяет допустимость аргументов (Неопределено или пустая Структура);
//  2) проверяет наличие активной кампании;
//  3) получает снимок контекста через КонтекстАссистента;
//  4) преобразует результат в AI-facing DTO.
//
// Параметры:
//   Аргументы - Структура, Неопределено - аргументы инструмента.
//
// Возвращаемое значение:
//   Структура - унифицированный результат.
//
Функция Выполнить_GetCurrentContext(Аргументы)

	Если НЕ ПроверитьАргументы_GetCurrentContext(Аргументы) Тогда
		Возврат РезультатОшибка("invalid_arguments",
			НСтр("ru = 'Инструмент get_current_context не принимает аргументов.'"));
	КонецЕсли;

	Кампания = УправлениеКампаниями.ПолучитьАктивнуюКампанию();
	Если НЕ ЗначениеЗаполнено(Кампания) Тогда
		Возврат РезультатОшибка("no_active_campaign",
			НСтр("ru = 'Не задана активная кампания.'"));
	КонецЕсли;

	Снимок = КонтекстАссистента.ПолучитьКонтекст();
	DTO = СнимокКонтекстаВDTO(Снимок);

	Возврат РезультатУспех(DTO);

КонецФункции

// Проверяет, что аргументы соответствуют схеме инструмента
// get_current_context: Неопределено или пустая Структура.
// Любое свойство в переданной структуре трактуется как
// недопустимый аргумент.
//
// Параметры:
//   Аргументы - Структура, Неопределено - аргументы инструмента.
//
// Возвращаемое значение:
//   Булево - Истина, если аргументы корректны.
//
Функция ПроверитьАргументы_GetCurrentContext(Аргументы)

	Если Аргументы = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТипЗнч(Аргументы) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Аргументы.Количество() = 0;

КонецФункции

// Реализация инструмента search_entities:
//  1) проверяет допустимость аргументов (query обязателен, types и limit -
//     по схеме);
//  2) проверяет наличие активной кампании;
//  3) запрашивает расширенный поиск у ПоискСущностей по нормализованной
//     строке;
//  4) применяет limit и признак truncated;
//  5) преобразует кандидатов в AI-facing DTO.
//
// Инструмент всегда работает только в пределах активной кампании,
// никаких аргументов выбора кампании не принимает.
//
// Параметры:
//   Аргументы - Структура, Неопределено - аргументы инструмента.
//
// Возвращаемое значение:
//   Структура - унифицированный результат.
//
Функция Выполнить_SearchEntities(Аргументы)

	ПараметрыВызова = ПроверитьАргументы_SearchEntities(Аргументы);
	Если ТипЗнч(ПараметрыВызова) <> Тип("Структура") Тогда
		Возврат РезультатОшибка("invalid_arguments",
			НСтр("ru = 'Некорректные аргументы search_entities.'"));
	КонецЕсли;

	Кампания = УправлениеКампаниями.ПолучитьАктивнуюКампанию();
	Если НЕ ЗначениеЗаполнено(Кампания) Тогда
		Возврат РезультатОшибка("no_active_campaign",
			НСтр("ru = 'Не задана активная кампания.'"));
	КонецЕсли;

	НормализованнаяСтрока = ПоискСущностей.НормализоватьСтроку(ПараметрыВызова.Query);

	КандидатыТаблица = ПоискСущностей.НайтиСущностиРасширенный(
		ПараметрыВызова.Query, ПараметрыВызова.Types);

	DTO = КандидатыПоискаВDTO(ПараметрыВызова.Query, НормализованнаяСтрока,
		КандидатыТаблица, ПараметрыВызова.Limit);

	Возврат РезультатУспех(DTO);

КонецФункции

// Проверяет аргументы search_entities и приводит их к каноническому виду.
// Возвращает структуру полей (Query, Types, Limit) при успехе или
// Неопределено при ошибке.
//
// Правила:
//   - query: Строка, после СокрЛП длина 1..150, не Неопределено;
//   - types: Необязательный. Если отсутствует - Неопределено (поиск по
//     всем типам). Иначе - Массив из Строка, длиной >= 1, без дублей,
//     только допустимые stable codes;
//   - limit: Необязательный. Если отсутствует - 10. Иначе - целое Число
//     в диапазоне 1..20. Не допускается автоматическое приведение
//     "10" -> 10 или 1.5 -> 2.
//   - Любое дополнительное свойство - ошибка.
//
Функция ПроверитьАргументы_SearchEntities(Аргументы)

	Если ТипЗнч(Аргументы) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ ТолькоДопустимыеКлючиSearchEntities(Аргументы) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Query = ПроверитьИИзвлечьQuery_SearchEntities(Аргументы);
	Если Query = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Types = ПроверитьИИзвлечьTypes_SearchEntities(Аргументы);
	Если Аргументы.Свойство("types") И Types = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Limit = ПроверитьИИзвлечьLimit_SearchEntities(Аргументы);
	Если Аргументы.Свойство("limit") И Limit = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Query", Query);
	Результат.Вставить("Types", Types);
	Результат.Вставить("Limit", Limit);

	Возврат Результат;

КонецФункции

// Проверяет, что в аргументах search_entities нет посторонних ключей.
//
Функция ТолькоДопустимыеКлючиSearchEntities(Аргументы)

	ДопустимыеКлючи = Новый Соответствие;
	ДопустимыеКлючи.Вставить("query", Истина);
	ДопустимыеКлючи.Вставить("types", Истина);
	ДопустимыеКлючи.Вставить("limit", Истина);

	Для Каждого КлючИЗначение Из Аргументы Цикл
		Если ДопустимыеКлючи.Получить(КлючИЗначение.Ключ) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

// Извлекает и валидирует query. Возвращает строку после СокрЛП
// или Неопределено при ошибке.
//
Функция ПроверитьИИзвлечьQuery_SearchEntities(Аргументы)

	Если НЕ Аргументы.Свойство("query") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Значение = Аргументы.query;
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Query = СокрЛП(Значение);
	Если ПустаяСтрока(Query) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если СтрДлина(Query) > МаксимальнаяДлинаЗапроса() Тогда
		Возврат Неопределено;
	КонецЕсли;

	НормализованнаяСтрока = ПоискСущностей.НормализоватьСтроку(Query);
	Если ПустаяСтрока(НормализованнаяСтрока) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Query;

КонецФункции

// Извлекает и валидирует types. Возвращает массив строк
// (без дублей, только допустимые коды), либо Неопределено, если
// свойство types отсутствует. Если свойство задано, но невалидно -
// возвращает Неопределено.
//
Функция ПроверитьИИзвлечьTypes_SearchEntities(Аргументы)

	Если НЕ Аргументы.Свойство("types") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Значение = Аргументы.types;
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Значение.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДопустимыеКоды = Новый Соответствие;
	Для Каждого ОписаниеТипа Из ПоискСущностей.ПоддерживаемыеТипы() Цикл
		ДопустимыеКоды.Вставить(ОписаниеТипа.StableCode, Истина);
	КонецЦикла;

	Результат = Новый Массив;
	Для Каждого Элемент Из Значение Цикл
		Если ТипЗнч(Элемент) <> Тип("Строка") Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если ДопустимыеКоды.Получить(Элемент) = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если Результат.Найти(Элемент) <> Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Результат.Добавить(Элемент);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Извлекает и валидирует limit. Возвращает целое число 1..20
// (по умолчанию ЛимитПоУмолчанию()) либо Неопределено, если
// свойство limit задано некорректно. Если свойство отсутствует -
// возвращает значение по умолчанию.
//
Функция ПроверитьИИзвлечьLimit_SearchEntities(Аргументы)

	Если НЕ Аргументы.Свойство("limit") Тогда
		Возврат ЛимитПоУмолчанию();
	КонецЕсли;

	Значение = Аргументы.limit;
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	// Запрет автоматических преобразований 1.5 -> 2.
	Если Значение <> Цел(Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Значение < 1 ИЛИ Значение > МаксимальныйЛимит() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Значение;

КонецФункции

// Максимально допустимая длина строки запроса search_entities.
//
Функция МаксимальнаяДлинаЗапроса()

	Возврат 150;

КонецФункции

// Лимит search_entities по умолчанию.
//
Функция ЛимитПоУмолчанию()

	Возврат 10;

КонецФункции

// Верхняя граница лимита search_entities.
//
Функция МаксимальныйЛимит()

	Возврат 20;

КонецФункции

// Преобразует таблицу кандидатов ПоискСущностей.НайтиСущностиРасширенный
// в AI DTO search_entities. Применяет лимит и вычисляет truncated.
//
// Лимит накладывается на уже глобально отсортированный результат,
// поэтому внутренняя выборка ПоискСущностей не зависит от лимита.
//
// Параметры:
//   Query              - Строка - исходный (после СокрЛП) запрос.
//   НормализованнаяСтрока - Строка - результат
//                          ПоискСущностей.НормализоватьСтроку(Query).
//   КандидатыТаблица   - ТаблицаЗначений - результат
//                          ПоискСущностей.НайтиСущностиРасширенный().
//   Limit              - Число - 1..20.
//
// Возвращаемое значение:
//   Структура - DTO:
//     * query            - Строка, Неопределено
//     * normalized_query - Строка
//     * items            - Массив Из Структура
//     * truncated        - Булево
//
Функция КандидатыПоискаВDTO(Query, НормализованнаяСтрока, КандидатыТаблица, Limit)

	Items = Новый Массив;

	ОбщееЧисло = КандидатыТаблица.Количество();
	ВозвращаемоеЧисло = Мин(ОбщееЧисло, Limit);
	Truncated = ОбщееЧисло > ВозвращаемоеЧисло;

	Для Сч = 0 По ВозвращаемоеЧисло - 1 Цикл
		СтрокаКандидата = КандидатыТаблица.Получить(Сч);
		Items.Добавить(КандидатВDTO(СтрокаКандидата));
	КонецЦикла;

	DTO = Новый Структура;
	DTO.Вставить("query", Query);
	DTO.Вставить("normalized_query", НормализованнаяСтрока);
	DTO.Вставить("items", Items);
	DTO.Вставить("truncated", Truncated);

	Возврат DTO;

КонецФункции

// Преобразует строку кандидата из таблицы
// ПоискСущностей.НайтиСущностиРасширенный в AI DTO.
//
// Параметры:
//   СтрокаКандидата - СтрокаТаблицыЗначений.
//
// Возвращаемое значение:
//   Структура - {id, type, name, match}.
//
Функция КандидатВDTO(СтрокаКандидата)

	DTO = Новый Структура;
	DTO.Вставить("id", СтрокаКандидата.Идентификатор);
	DTO.Вставить("type", СтрокаКандидата.StableCode);
	DTO.Вставить("name", СтрокаКандидата.Наименование);
	DTO.Вставить("match", СтрокаКандидата.ЛучшееСовпадение);

	Возврат DTO;

КонецФункции

// Реализация инструмента get_entity:
//  1) проверяет допустимость аргументов (id и type обязательны);
//  2) проверяет наличие активной кампании;
//  3) разбирает UUID и получает ссылку через ПоискСущностей
//     с проверкой принадлежности активной кампании;
//  4) формирует компактный AI-facing DTO.
//
// Инструмент read-only и всегда работает только в пределах активной
// кампании. Никаких аргументов выбора кампании не принимает.
//
// Параметры:
//   Аргументы - Структура, Неопределено - аргументы инструмента.
//
// Возвращаемое значение:
//   Структура - унифицированный результат.
//
Функция Выполнить_GetEntity(Аргументы)

	ПараметрыВызова = ПроверитьАргументы_GetEntity(Аргументы);
	Если ТипЗнч(ПараметрыВызова) <> Тип("Структура") Тогда
		Возврат РезультатОшибка("invalid_arguments",
			НСтр("ru = 'Некорректные аргументы get_entity.'"));
	КонецЕсли;

	Кампания = УправлениеКампаниями.ПолучитьАктивнуюКампанию();
	Если НЕ ЗначениеЗаполнено(Кампания) Тогда
		Возврат РезультатОшибка("no_active_campaign",
			НСтр("ru = 'Не задана активная кампания.'"));
	КонецЕсли;

	РезультатПоиска = ПоискСущностей.ПолучитьСущностьПоИдентификатору(
		ПараметрыВызова.StableCode,
		ПараметрыВызова.УИД,
		Кампания);

	Если НЕ РезультатПоиска.Найдено Тогда
		Возврат РезультатОшибка("entity_not_found",
			НСтр("ru = 'Сущность не найдена в активной кампании.'"));
	КонецЕсли;

	DTO = СущностьВDTO(РезультатПоиска.Объект, ПараметрыВызова.StableCode,
		РезультатПоиска.Наименование);

	Возврат РезультатУспех(DTO);

КонецФункции

// Проверяет аргументы get_entity и приводит их к каноническому виду.
// Возвращает структуру полей (УИД, StableCode) при успехе или
// Неопределено при ошибке.
//
// Правила:
//   - id: обязателен, непустая Строка, успешно разбирается
//     в УникальныйИдентификатор. Регистр символов не имеет значения.
//   - type: обязателен, Строка, присутствует в
//     ПоискСущностей.ПоддерживаемыеТипы().
//   - Любое дополнительное свойство - ошибка.
//
Функция ПроверитьАргументы_GetEntity(Аргументы)

	Если ТипЗнч(Аргументы) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ ТолькоДопустимыеКлючиGetEntity(Аргументы) Тогда
		Возврат Неопределено;
	КонецЕсли;

	УИД = ПроверитьИИзвлечьId_GetEntity(Аргументы);
	Если УИД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	StableCode = ПроверитьИИзвлечьType_GetEntity(Аргументы);
	Если StableCode = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("УИД", УИД);
	Результат.Вставить("StableCode", StableCode);

	Возврат Результат;

КонецФункции

// Проверяет, что в аргументах get_entity нет посторонних ключей.
//
Функция ТолькоДопустимыеКлючиGetEntity(Аргументы)

	ДопустимыеКлючи = Новый Соответствие;
	ДопустимыеКлючи.Вставить("id", Истина);
	ДопустимыеКлючи.Вставить("type", Истина);

	Для Каждого КлючИЗначение Из Аргументы Цикл
		Если ДопустимыеКлючи.Получить(КлючИЗначение.Ключ) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

// Извлекает и валидирует id. Принимает только непустую строку,
// успешно разбираемую в УникальныйИдентификатор. Регистр символов
// не имеет значения.
//
// Возвращает УникальныйИдентификатор либо Неопределено.
//
Функция ПроверитьИИзвлечьId_GetEntity(Аргументы)

	Если НЕ Аргументы.Свойство("id") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Значение = Аргументы.id;
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;

	НормализованныйИдентификатор = СокрЛП(Значение);
	Если ПустаяСтрока(НормализованныйИдентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если СтрДлина(НормализованныйИдентификатор) > МаксимальнаяДлинаИдентификатора() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		УИД = Новый УникальныйИдентификатор(НормализованныйИдентификатор);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Возврат УИД;

КонецФункции

// Извлекает и валидирует type. Принимает только Строку, присутствующую
// в ПоискСущностей.ПоддерживаемыеТипы().
//
// Возвращает стабильный код типа либо Неопределено.
//
Функция ПроверитьИИзвлечьType_GetEntity(Аргументы)

	Если НЕ Аргументы.Свойство("type") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Значение = Аргументы.type;
	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДопустимыеКоды = Новый Соответствие;
	Для Каждого ОписаниеТипа Из ПоискСущностей.ПоддерживаемыеТипы() Цикл
		ДопустимыеКоды.Вставить(ОписаниеТипа.StableCode, Истина);
	КонецЦикла;

	Если ДопустимыеКоды.Получить(Значение) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Значение;

КонецФункции

// Верхняя граница длины строкового идентификатора,
// принимаемого инструментом get_entity.
//
Функция МаксимальнаяДлинаИдентификатора()

	Возврат 40;

КонецФункции

// Преобразует ссылку на сущность в AI-facing DTO.
// Делегирует построение блока details предметной функции для
// соответствующего StableCode. Никогда не возвращает наружу
// ссылок 1С - все идентификаторы передаются в виде UUID,
// перечисления преобразуются в стабильные строковые коды.
//
// Параметры:
//   Объект        - ОпределяемыйТип.СущностиКампании.
//   StableCode    - Строка - стабильный код типа.
//   Наименование  - Строка - каноническое имя сущности.
//
// Возвращаемое значение:
//   Структура - DTO: {id, type, name, details}.
//
Функция СущностьВDTO(Объект, StableCode, Наименование)

	DTO = Новый Структура;
	DTO.Вставить("id", ИдентификаторСущности(Объект));
	DTO.Вставить("type", StableCode);
	DTO.Вставить("name", Наименование);
	DTO.Вставить("details", ДеталиСущностиВDTO(Объект, StableCode));

	Возврат DTO;

КонецФункции

// Возвращает UUID сущности в нижнем регистре. Для невалидированных
// ссылок возвращает пустую строку - такие ситуации не должны
// возникать, так как на этом этапе объект уже прошёл campaign
// isolation в ПоискСущностей.ПолучитьСущностьПоИдентификатору.
//
Функция ИдентификаторСущности(Объект)

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат "";
	КонецЕсли;

	Возврат НРег(Строка(Объект.УникальныйИдентификатор()));

КонецФункции

// Диспетчер построения блока details по StableCode. Сами
// типоспецифичные наборы полей описаны в отдельных
// вспомогательных функциях. Любые ссылки 1С внутри details
// преобразуются в компактные reference-DTO либо в null.
//
Функция ДеталиСущностиВDTO(Объект, StableCode)

	Если StableCode = "npc" Тогда
		Возврат ДеталиNPC(Объект);
	ИначеЕсли StableCode = "player_character" Тогда
		Возврат ДеталиПерсонажа(Объект);
	ИначеЕсли StableCode = "location" Тогда
		Возврат ДеталиЛокации(Объект);
	ИначеЕсли StableCode = "quest" Тогда
		Возврат ДеталиКвеста(Объект);
	ИначеЕсли StableCode = "item" Тогда
		Возврат ДеталиПредмета(Объект);
	ИначеЕсли StableCode = "organization" Тогда
		Возврат ДеталиОрганизации(Объект);
	ИначеЕсли StableCode = "event" Тогда
		Возврат ДеталиСобытия(Объект);
	ИначеЕсли StableCode = "note" Тогда
		Возврат ДеталиЗаметки(Объект);
	Иначе
		Возврат Новый Структура;
	КонецЕсли;

КонецФункции

// Детали карточки NPC: раса, профессия, описание. Прямых ссылок
// на другие сущности кампании в метаданных NPC нет.
//
Функция ДеталиNPC(Объект)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект, "Раса, Профессия, Описание");

	Детали = Новый Структура;
	Детали.Вставить("race",      СтрокаРеквизита(Реквизиты, "Раса"));
	Детали.Вставить("profession", СтрокаРеквизита(Реквизиты, "Профессия"));
	Детали.Вставить("description", СтрокаРеквизита(Реквизиты, "Описание"));

	Возврат Детали;

КонецФункции

// Детали карточки персонажа игрока: раса, класс, уровень, описание.
//
Функция ДеталиПерсонажа(Объект)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект, "Раса, Класс, Уровень, Описание");

	Детали = Новый Структура;
	Детали.Вставить("race", СтрокаРеквизита(Реквизиты, "Раса"));
	Детали.Вставить("class", СтрокаРеквизита(Реквизиты, "Класс"));
	Детали.Вставить("level", ЧислоРеквизита(Реквизиты, "Уровень"));
	Детали.Вставить("description", СтрокаРеквизита(Реквизиты, "Описание"));

	Возврат Детали;

КонецФункции

// Детали карточки локации: описание. Иерархия локаций в R03
// не разворачивается - полный путь по Parent не входит в контракт
// details.
//
Функция ДеталиЛокации(Объект)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект, "Описание");

	Детали = Новый Структура;
	Детали.Вставить("description", СтрокаРеквизита(Реквизиты, "Описание"));

	Возврат Детали;

КонецФункции

// Детали карточки квеста: статус (стабильная строка), описание.
// Перечисление СтатусыКвестов преобразуется в локальный
// машинный код, не зависящий от представления.
//
Функция ДеталиКвеста(Объект)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект, "Статус, Описание");

	Детали = Новый Структура;
	Детали.Вставить("status", КодСтатусаКвеста(Реквизиты));
	Детали.Вставить("description", СтрокаРеквизита(Реквизиты, "Описание"));

	Возврат Детали;

КонецФункции

// Детали карточки предмета: категория (CatalogRef.КатегорииПредметов
// не входит в определяемый тип "СущностиКампании", поэтому
// возвращается как простая строка имени, без reference-DTO),
// описание.
//
Функция ДеталиПредмета(Объект)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект, "Категория, Описание");

	Детали = Новый Структура;
	Детали.Вставить("category", ИмяКатегорииПредмета(Реквизиты));
	Детали.Вставить("description", СтрокаРеквизита(Реквизиты, "Описание"));

	Возврат Детали;

КонецФункции

// Детали карточки организации: тип, описание.
//
Функция ДеталиОрганизации(Объект)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект, "ТипОрганизации, Описание");

	Детали = Новый Структура;
	Детали.Вставить("type", СтрокаРеквизита(Реквизиты, "ТипОрганизации"));
	Детали.Вставить("description", СтрокаРеквизита(Реквизиты, "Описание"));

	Возврат Детали;

КонецФункции

// Детали карточки события: игровые минуты начала и окончания,
// статус (стабильная строка), описание. Минуты преобразуются в
// {minute, display} с использованием существующего ИгровойКалендарь.
//
Функция ДеталиСобытия(Объект)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект, "Начало, Окончание, Статус, Описание");

	Детали = Новый Структура;
	Детали.Вставить("start",    ИгроваяМинутаВDTO(ЧислоРеквизита(Реквизиты, "Начало")));
	Детали.Вставить("end",      ИгроваяМинутаВDTO(ЧислоРеквизита(Реквизиты, "Окончание")));
	Детали.Вставить("status",   КодСтатусаСобытия(Реквизиты));
	Детали.Вставить("description", СтрокаРеквизита(Реквизиты, "Описание"));

	Возврат Детали;

КонецФункции

// Детали карточки заметки: дата создания (как игровая минута,
// если значение приведено к числу; в метаданных - Дата,
// преобразуется к представлению строкой даты и ISO-строке),
// текст заметки.
//
Функция ДеталиЗаметки(Объект)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект, "Текст, ДатаСоздания");

	Детали = Новый Структура;
	Детали.Вставить("text", СтрокаРеквизита(Реквизиты, "Текст"));
	Детали.Вставить("created_at", ДатаСозданияЗаметкиВDTO(Реквизиты));

	Возврат Детали;

КонецФункции

// Возвращает строковое значение реквизита, либо пустую строку.
// Используется для безопасного извлечения строковых полей из
// результата ОбщегоНазначения.ЗначенияРеквизитовОбъекта().
//
Функция СтрокаРеквизита(Реквизиты, ИмяПоля)

	Если ТипЗнч(Реквизиты) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;

	Если НЕ Реквизиты.Свойство(ИмяПоля) Тогда
		Возврат "";
	КонецЕсли;

	Значение = Реквизиты[ИмяПоля];
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Если Значение = NULL Тогда
		Возврат "";
	КонецЕсли;

	Возврат Строка(Значение);

КонецФункции

// Возвращает числовое значение реквизита, либо Неопределено.
// Используется для безопасного извлечения числовых полей
// (Уровень, Начало, Окончание).
//
Функция ЧислоРеквизита(Реквизиты, ИмяПоля)

	Если ТипЗнч(Реквизиты) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ Реквизиты.Свойство(ИмяПоля) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Значение = Реквизиты[ИмяПоля];
	Если ТипЗнч(Значение) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Значение;

КонецФункции

// Преобразует игровую минуту события в DTO {minute, display}.
// Для пустого значения возвращает Неопределено (сериализуется
// в JSON null).
//
Функция ИгроваяМинутаВDTO(ИгроваяМинута)

	Если ИгроваяМинута = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Представление = ИгровойКалендарь.ПредставлениеДаты(ИгроваяМинута);
	Исключение
		Представление = "";
	КонецПопытки;

	DTO = Новый Структура;
	DTO.Вставить("minute", ИгроваяМинута);
	DTO.Вставить("display", Представление);

	Возврат DTO;

КонецФункции

// Преобразует дату создания заметки в DTO. Возвращает пару
// {date, iso} - где date приведено к числу дней от даты,
// а iso - строковое ISO-представление для удобства AI.
// При отсутствии даты возвращает Неопределено.
//
Функция ДатаСозданияЗаметкиВDTO(Реквизиты)

	Если ТипЗнч(Реквизиты) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ Реквизиты.Свойство("ДатаСоздания") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Дата = Реквизиты.ДатаСоздания;
	Если ТипЗнч(Дата) <> Тип("Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;

	DTO = Новый Структура;
	DTO.Вставить("date", Дата);
	DTO.Вставить("iso", XMLСтрока(Дата));

	Возврат DTO;

КонецФункции

// Возвращает стабильный строковый код статуса квеста по значению
// перечисления СтатусыКвестов. Использует явное локальное
// соответствие - представление перечисления не применяется
// как машинный код.
//
// При пустой ссылке - возвращает Неопределено.
//
Функция КодСтатусаКвеста(Реквизиты)

	Если ТипЗнч(Реквизиты) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ Реквизиты.Свойство("Статус") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Статус = Реквизиты.Статус;
	Если ТипЗнч(Статус) <> Тип("ПеречислениеСсылка.СтатусыКвестов") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Статус = Перечисления.СтатусыКвестов.Новый Тогда
		Возврат "new";
	ИначеЕсли Статус = Перечисления.СтатусыКвестов.Активный Тогда
		Возврат "active";
	ИначеЕсли Статус = Перечисления.СтатусыКвестов.Приостановлен Тогда
		Возврат "paused";
	ИначеЕсли Статус = Перечисления.СтатусыКвестов.Завершен Тогда
		Возврат "completed";
	ИначеЕсли Статус = Перечисления.СтатусыКвестов.Провален Тогда
		Возврат "failed";
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Возвращает стабильный строковый код статуса события по значению
// перечисления СтатусыСобытий. Использует явное локальное
// соответствие - представление перечисления не применяется
// как машинный код.
//
// При пустой ссылке - возвращает Неопределено.
//
Функция КодСтатусаСобытия(Реквизиты)

	Если ТипЗнч(Реквизиты) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ Реквизиты.Свойство("Статус") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Статус = Реквизиты.Статус;
	Если ТипЗнч(Статус) <> Тип("ПеречислениеСсылка.СтатусыСобытий") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Статус = Перечисления.СтатусыСобытий.Запланировано Тогда
		Возврат "planned";
	ИначеЕсли Статус = Перечисления.СтатусыСобытий.Завершено Тогда
		Возврат "completed";
	ИначеЕсли Статус = Перечисления.СтатусыСобытий.Отменено Тогда
		Возврат "cancelled";
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Возвращает строковое имя категории предмета. Категория не входит
// в определяемый тип "СущностиКампании", поэтому reference-DTO
// для неё не строится - только короткое имя.
//
Функция ИмяКатегорииПредмета(Реквизиты)

	Если ТипЗнч(Реквизиты) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ Реквизиты.Свойство("Категория") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Категория = Реквизиты.Категория;
	Если НЕ ЗначениеЗаполнено(Категория) Тогда
		Возврат Неопределено;
	КонецЕсли;

	РеквизитыКатегории = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Категория, "Наименование");

	Если ТипЗнч(РеквизитыКатегории) = Тип("Структура")
		И РеквизитыКатегории.Свойство("Наименование") Тогда
		Возврат Строка(РеквизитыКатегории.Наименование);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Преобразует снимок контекста, полученный из КонтекстАссистента,
// в компактный AI-facing DTO. Не возвращает ссылок 1С наружу -
// все идентификаторы передаются в виде стабильного строкового UUID,
// отсутствующие значения - как Неопределено (сериализуется в JSON null).
//
// Параметры:
//   Снимок - Структура - результат КонтекстАссистента.ПолучитьКонтекст().
//
// Возвращаемое значение:
//   Структура - DTO результата инструмента.
//
Функция СнимокКонтекстаВDTO(Снимок)

	DTO = Новый Структура;
	DTO.Вставить("campaign",  ОписаниеСправочникаВDTO(Снимок.Кампания));
	DTO.Вставить("character", ОписаниеСправочникаВDTO(Снимок.Персонаж));
	DTO.Вставить("location",  ОписаниеСправочникаВDTO(Снимок.Локация));
	DTO.Вставить("game_time", ИгровоеВремяВDTO(Снимок.ИгроваяМинута));
	DTO.Вставить("wallet",    КошелекВDTO(Снимок.Кошелек));

	Возврат DTO;

КонецФункции

// Преобразует ссылку на элемент справочника в DTO с UUID и именем.
// Для пустой ссылки возвращает Неопределено (для сериализации в JSON null).
//
// Параметры:
//   Ссылка - СправочникСсылка, Неопределено - ссылка на элемент справочника.
//
// Возвращаемое значение:
//   Структура, Неопределено - {"id": "...", "name": "..."} или Неопределено.
//
Функция ОписаниеСправочникаВDTO(Ссылка)

	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Имя = "";
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Наименование");
	Если ТипЗнч(Реквизиты) = Тип("Структура") И Реквизиты.Свойство("Наименование") Тогда
		Имя = Строка(Реквизиты.Наименование);
	КонецЕсли;

	DTO = Новый Структура;
	DTO.Вставить("id", НРег(Строка(Ссылка.УникальныйИдентификатор())));
	DTO.Вставить("name", Имя);

	Возврат DTO;

КонецФункции

// Преобразует игровое время к DTO. Если минута не задана - возвращает
// Неопределено (сериализуется в JSON null), иначе собирает пару
// исходной минуты и человекочитаемого представления.
//
// Параметры:
//   ИгроваяМинута - Число, Неопределено - минута игрового времени.
//
// Возвращаемое значение:
//   Структура, Неопределено - {"minute": N, "display": "..."} или Неопределено.
//
Функция ИгровоеВремяВDTO(ИгроваяМинута)

	Если ИгроваяМинута = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	DTO = Новый Структура;
	DTO.Вставить("minute", ИгроваяМинута);
	DTO.Вставить("display", ИгровойКалендарь.ПредставлениеДаты(ИгроваяМинута));

	Возврат DTO;

КонецФункции

// Преобразует остаток кошелька к DTO. Если кошелек отсутствует
// (нет активного персонажа) - возвращает Неопределено.
// Номиналы всегда передаются пятью отдельными числовыми полями.
//
// Параметры:
//   Кошелек - Структура, Неопределено - кошелек персонажа.
//
// Возвращаемое значение:
//   Структура, Неопределено - {"pp":..., "gp":..., "ep":..., "sp":..., "cp":...}
//   или Неопределено.
//
Функция КошелекВDTO(Кошелек)

	Если Кошелек = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	DTO = Новый Структура;
	DTO.Вставить("pp", МонетыНоминала(Кошелек, "PP"));
	DTO.Вставить("gp", МонетыНоминала(Кошелек, "GP"));
	DTO.Вставить("ep", МонетыНоминала(Кошелек, "EP"));
	DTO.Вставить("sp", МонетыНоминала(Кошелек, "SP"));
	DTO.Вставить("cp", МонетыНоминала(Кошелек, "CP"));

	Возврат DTO;

КонецФункции

// Возвращает значение номинала из структуры кошелька либо 0,
// если соответствующее поле отсутствует. Защищает DTO от
// неконсистентного остатка.
//
// Параметры:
//   Кошелек - Структура - остаток кошелька;
//   ИмяПоля - Строка - имя номинала ("PP", "GP", "EP", "SP", "CP").
//
// Возвращаемое значение:
//   Число - количество монет указанного номинала.
//
Функция МонетыНоминала(Кошелек, ИмяПоля)

	Если ТипЗнч(Кошелек) <> Тип("Структура") Тогда
		Возврат 0;
	КонецЕсли;

	Если НЕ Кошелек.Свойство(ИмяПоля) Тогда
		Возврат 0;
	КонецЕсли;

	Значение = Кошелек[ИмяПоля];
	Если ТипЗнч(Значение) <> Тип("Число") Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Значение;

КонецФункции

// Формирует структуру успешного результата.
//
// Параметры:
//   DTO - Структура - данные результата.
//
// Возвращаемое значение:
//   Структура - {success: Истина, data: <DTO>, error: Неопределено}.
//
Функция РезультатУспех(DTO)

	Результат = Новый Структура;
	Результат.Вставить("success", Истина);
	Результат.Вставить("data", DTO);
	Результат.Вставить("error", Неопределено);

	Возврат Результат;

КонецФункции

// Формирует структуру ошибочного результата. Текст ошибки
// формируется на русском, код ошибки - стабильный английский.
//
// Параметры:
//   Код     - Строка - машинный код ошибки;
//   Сообщение - Строка - человекочитаемое сообщение.
//
// Возвращаемое значение:
//   Структура - {success: Ложь, data: Неопределено, error: <{code, message}>}.
//
Функция РезультатОшибка(Код, Сообщение)

	Ошибка = Новый Структура;
	Ошибка.Вставить("code", Код);
	Ошибка.Вставить("message", Сообщение);

	Результат = Новый Структура;
	Результат.Вставить("success", Ложь);
	Результат.Вставить("data", Неопределено);
	Результат.Вставить("error", Ошибка);

	Возврат Результат;

КонецФункции

// Регистрирует неожиданное исключение в журнале регистрации.
// AI не получает деталей исключения 1С со стеком вызовов -
// только стабильный код internal_error.
//
// Параметры:
//   ИмяСобытия     - Строка - имя события журнала регистрации;
//   ИмяИнструмента - Строка - имя инструмента, при вызове которого
//                     произошло исключение;
//   ИнформацияОбОшибке - ИнформацияОбОшибке - объект с описанием исключения.
//
Процедура ЗаписатьОшибкуВЖурнал(ИмяСобытия, ИмяИнструмента, ИнформацияОбОшибке)

	ПодробностиОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	ТекстОшибки = СтрШаблон(
		НСтр("ru = 'Инструмент: %1
			 |%2'"), ИмяИнструмента, ПодробностиОшибки);

	ЗаписьЖурналаРегистрации(
		ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);

КонецПроцедуры

#КонецОбласти
